#+TITLE: CPD Log
#+AUTHOR: Paul Hewson
#+EMAIL: phewson@wifispark.com
#+OPTIONS: toc:0 author:t email:t num:nil
#+COLUMNS: %10ITEM(Task) %10TAGS %20BENEFITS(BENEFITS TO SELF) %20BENEFITS_TO_USER(BENEFITS TO USER) %20CLOCKSUM %Effort(Effort){:}
#+TAGS: WorkBasedLearning(w)  ProfessionalActivity(p)  FormalLearning(f)  SelfDirectedLearning(s) Other(o)



*** Exam Panel UWS :WorkBasedLearning:
    :PROPERTIES:
    :EFFORT:   8:00
    :BENEFITS_TO_USER: Maintains academic standards, discussions about best practice
    :BENEFITS: Evaluate potential best practice, gauge student response
    :END:
    :LOGBOOK:
    CLOCK: [2019-01-15 Mon 09:00]--[2019-01-15 Mon 13:48] =>  4:48
    :END:
The task involves reading exam scripts and coursework submissions. The latter are electronic and hence read ahead of time.
The panel itself involves discussions with colleagues.

*** Consider papers for AA&P, received reviews         :SelfDirectedLearning:
    :PROPERTIES:
    :EFFORT:   1:00
    :BENEFITS_TO_USER: Maintenance of peer review system in publications
    :BENEFITS: Reconciling referees comments, judgements about importance of comments
    :END:
    :LOGBOOK:
    CLOCK: [2019-02-05 Tue 19:40]--[2019-02-05 Tue 21:16] =>  1:36
    :END:
Ongoing task, don't always log as sometimes this is very mechanical.


*** Exeter GIS MeetUp                                 :ProfessionalActivity:
    :PROPERTIES:
    :EFFORT:   2:00
    :BENEFITS: "Better knowledge of the breadth of GIS skills (and which I don't have)"
    :BENEFITS_TO_USER: Professional networking opportunities
    :END:
    :LOGBOOK:
   CLOCK: [2019-03-14 Tue 17:15]--[2019-03-14 Tue 19:30] =>  2:15
   :END:
This was a useful networking exercise.
1. Made contact with map making company, i.e., people who take great care on the cosmetic presentation of map information
2. Made contact with property evaluation company, they are interesting because they are a mature company who have been doing GIS since before it was fashionable

*** Local forecasts, report and meeting with Client (CCC). :WorkBasedLearning:ProfessionalActivity:
    :PROPERTIES:
    :BENEFITS_TO_USER: Obtained set of local area predictions AND report discussing assumptions
    :EFFORT: 16:00
    :BENEFITS: Revision of STAN useage
    :END:
    :LOGBOOK:
    CLOCK: [2020-04-16 Tue 08:20]--[2020-04-16 Tue 12:30] =>  0:00
    CLOCK: [2020-04-16 Tue 13:06]--[2020-04-16 Tue 17:30] =>  0:00
    CLOCK: [2020-04-17 Wed 08:11]--[2020-04-16 Wed 12:07] =>  0:00
    CLOCK: [2020-04-16 Wed 12:48--[2020-04-16 Wed 16:55] =>  0:00
    CLOCK: [2020-04-16 Thu 08:32]--[2020-04-16 Thu 11:55] =>  0:00
    :END:

The goal of the project was to deliver a small area forecasting system that could apply the National Trip End Model estimates (NTEM) to smaller areas.
This was done with a Google Sheet which allowed the client to alter the input data (allocate jobs/housing to specific smaller areas than modelled by NTEM).
- Revise usage of Stan for fitting Bayesian models
- Figure out how to use Stan from Python
- Fit and check small area estimation models
- Write report for end user
- Meet end user and discuss feedback

Note: I'm not convinced the client really wanted the ability to alter the input assumptions, they just wanted an "external expert" set of predictions.

*** Exam Panel UWS :WorkBasedLearning:
    :PROPERTIES:
    :EFFORT:   8:00
    :BENEFITS_TO_USER: Maintains academic standards, discussions about best practice
    :BENEFITS: Evaluate potential best practice, gauge student response
    :END:
    :LOGBOOK:
    CLOCK: [2019-05-14 Tue 09:00]--[2019-05-14 Tue 13:38] =>  4:38
    :END:
(Note, logged time relates to exam scripts and exam panel meeting, also checkout out online submissions ahead of time)

*** Small Area Estimation (Natural England)            :ProfessionalActivity:
    :PROPERTIES:
    :EFFORT: 5:00
    :BENEFITS: Good discussion about interpretation of statistical results
    :BENEFITS_TO_USER: Report with support understanding results
    :SUPPORTING_EVIDENCE: Course certificate
    :END:
   :LOGBOOK:
   CLOCK: [2019-03-16 Sat 06:10]--[2019-03-16 Sun 21:00] => 14:50
   CLOCK: [2019-03-17 Sun 06:20]--[2019-03-17 Sun 10:22] =>  4:02
   CLOCK: [2019-03-24 Sun 06:14]--[2019-03-24 Sun 15:13] =>  8:59
   CLOCK: [2019-04-13 Sat 06:11]--[2019-04-13 Sat 14:31] =>  8:20
   CLOCK: [2019-04-14 Sun 06:00]--[2019-04-14 Sun 13:13] =>  7:13
   CLOCK: [2019-04-20 Sat 05:50]--[2019-04-20 Sat 12:30] =>  6:40
   CLOCK: [2019-04-23 Tue 11:00]--[2019-04-23 Tue 12:46]   =>  1:46
   :END:
- This was a stand alone project producing small area estimates from a well established survey.
- The client was Natural England.
- Most of the work is now largely routine to me.
- However, there was HUGE CPD value in that we had a very open discussion about the interpretation of the results. This provided me with a very clear idea of the level of understanding of those who have to interpret/defend the results, and their willingness to understand. I wrote some appendices explaining interpretation and they were very happy with these. I have had many client who don't want results that need work on their part to understand, which can limit the support you can offer. That was not the case in this instance.

*** Heat Transfer Coefficient                          :SelfDirectedLearning:
    :PROPERTIES:
    :BENEFITS: Overview of statistical methods for estimating HTC
    :EFFORT: 8:00
:BENEFITS_TO_USER: Range of alternative methods for estimating HTC, recommendations on complexity and feasibility
    :END:
    :LOGBOOK:
    CLOCK: [2019-06-10 Mon 08:46]--[2019-06-10 Mon 12:43] =>  3:57
    CLOCK: [2019-06-10 Mon 13:34]--[2019-06-10 Mon 17:36] =>  4:02
    CLOCK: [2019-06-11 Tue 08:39]--[2019-06-11 Tue 12:39] =>  4:00
    CLOCK: [2019-06-11 Tue 13:15]--[2019-06-11 Tue 17:33] =>  4:18
    CLOCK: [2019-06-12 Wed 08:42]--[2019-06-12 Wed 11:55] =>  3:13
    :END:
 - There are a range of black / grey models used to estimate HTC
 - I have sketched (in Python) one method that estimate HTC based on changepoint regression.
 - Other models require estimates of dynamical systems, this is a little outside my expertise and I have reported this.


*** Exam Panel UWS :WorkBasedLearning:
   :PROPERTIES:
   :EFFORT: 1:00
   :BENEFITS_TO_USER: Maintains academic standards, discussions about best practice
   :BENEFITS: Evaluate potential best practice, gauge student response
   :END:
   :LOGBOOK:
   CLOCK: [2019-08-13 Tue 10:34]--[2019-08-13 Tue 13:41] =>  3:07
   :END:
This was a resit panel, and I don't think I gained a lot of CPD value

*** Splunk exercise                             :Other:
    :PROPERTIES:
    :EFFORT: 12:00
    :BENEFITS: Awareness of event data, and methods for processing
    :BENEFITS_TO_USER: Understanding how to handle wider range of data types
    :SUPPORTING_EVIDENCE: Emails
    :END:
   :LOGBOOK:
   CLOCK: [2019-11-12 Tue 19:00]--[2019-11-12 Tue 22:00] =>  3:00
   CLOCK: [2019-11-13 Wed 18:30]--[2019-11-13 Wed 20:15] =>  1:45
   CLOCK: [2019-11-14 Thu 19:30]--[2019-11-14 Thu 21:30] =>  2:00
   CLOCK: [2019-11-15 Fri 19:00]--[2019-11-15 Fri 20:15] =>  1:15
   CLOCK: [2019-11-16 Sat 11:00]--[2019-11-16 Sat 16:45] =>  5:45
   :END:
  - This was an interview preparation, but in a new area for me (event data).
  - Challenging exercise figuring out query logic from a written exercise.
  - Self study around NOSQL, SQL/JSON 2 in PostgreSQL
  - Designing dashboard for interview.
  - Learnt a new tool ("Splunk") for analysing event data (primarily logs).
  - Constructing a Dashboard required revision of relevant best practice in dashboard design, and evaluation of dashboard wireframe tools.

*** Consider papers for AA&P, received reviews         :SelfDirectedLearning:
    :PROPERTIES:
    :EFFORT:   1:00
    :BENEFITS_TO_USER: Maintenance of peer review system in publications
    :BENEFITS: Reconciling referees comments, judgements about importance of comments
    :END:
    :LOGBOOK:
    CLOCK: [2019-11-28 Thu 21:40]--[2019-11-28 Tue 22:29] =>  0:49
    :END:
Ongoing task, don't always log as sometimes this is very mechanical.


*** Splunk Fundamentals    :FormalLearning:
    :PROPERTIES:
    :EFFORT: 20:00
    :BENEFITS: Learnt new data analysis tool for new (to me) data type
    :BENEFITS_TO_USER: Wider range of knowledge about data sources and methods
    :SUPPORTING_EVIDENCE: Course certificate
    :END:
   :LOGBOOK:
   CLOCK: [2019-11-19 Tue 19:00]--[2019-11-19 Tue 21:00] =>  2:00
   CLOCK: [2019-11-20 Wed 18:30]--[2019-11-20 Wed 20:20] =>  1:50
   CLOCK: [2019-11-21 Thu 19:00]--[2019-11-21 Thu 21:15] =>  2:15
   CLOCK: [2019-11-22 Fri 20:00]--[2019-11-22 Fri 20:55] =>  0:55
   CLOCK: [2019-11-23 Sat 16:00]--[2019-11-23 Sat 18:00] =>  2:00
   CLOCK: [2019-11-26 Tue 19:00]--[2019-11-26 Tue 22:30] =>  3:30
   CLOCK: [2019-11-27 Wed 18:30]--[2019-11-27 Wed 20:00] =>  1:30
   CLOCK: [2019-11-28 Thu 19:00]--[2019-11-28 Thu 23:30] =>  4:30
   :END:
  - The software was new to me, as was the idea of analysing event data (computer logs)
  - I can see a lot of applications for this type of analysis.

*** Process Mapping                                    :SelfDirectedLearning:
    :PROPERTIES:
    :EFFORT: 12:00
    :BENEFITS: Better understanding of process mapping event related data
    :BENEFITS_TO_USER: Deeper understanding of user flow through a system
    :SUPPORTING_EVIDENCE: Blog posting
    :END:
   :LOGBOOK:
   CLOCK: [2019-12-10 Tue 18:17]--[2019-12-10 Tue 22:49] =>  4:32
   CLOCK: [2019-12-11 Wed 18:30]--[2019-12-11 Wed 22:44] =>  4:14
   CLOCK: [2019-12-12 Thu 19:00]--[2019-12-12 Thu 22:56] =>  3:56
   :END:
 - Explored use of process mapping to outline how users transition states based on events in log files.
 - This is a completely novel idea to the client. The goal is to highlight cases where performance is limited by delayed transition between states (or duplicated transitions).
 - Output an internal blog (didn't get feedback in 2019).

[[https://docs.google.com/document/d/159bBpc1VSG09ZS8gJkAFIb5rsW_eFE0q2MUtNYz9HwQ/edit?usp=sharing][Link to report]]  They are all subscriber_type_id 2 (fixed_duration) at the second one (Epsom and St Helier hospital). I can't see any information on charge, and we only have session expiry info, not subscription expiry. Otherwise, we can get the rest. 

